from datetime import time
from dotenv import load_dotenv
from os import getenv

load_dotenv()

BOT_TOKEN = getenv('BOT_TOKEN')
ADMINS = [867536228, 1102139690, 1085182474]

SHEDULE = [
    (time(8, 20), time(10, 0)),
    (time(10, 0), time(11, 40)),
    (time(11, 40), time(13, 20)),
    (time(13, 20), time(15, 0)),
    (time(15, 0), time(16, 40)),
    (time(16, 40), time(18, 20)),
    (time(18, 20), time(20, 0)),
    (time(20, 0), time(21, 40)),
    # (time(0, 0), time(23, 59)) # tests
]

CHALLENGES = [
    (
        'Помаши рукой 👋',
        'Кивни головой 🙂‍↕️',
        'Покажи класс 👍'
    ),
    (
        'студент',
        'набка',
        'шаттл',
        'лекция',
        'сессия',
        'зачет',
        'экзамен',
        'кампус',
        'стипуха',
        'конспект',
        'профессор',
        'препод',
        'семестр',
        'лаба',
        'общага',
        'диплом',
        'библиотека',
        'курсовая',
        'абитуриент',
        'кб сила',
        'каникулы',
        'семинар'
    )
]
